tap "felixkratz/formulae"
tap "homebrew/services"
tap "kardolus/chatgpt-cli"
tap "leoafarias/fvm"
tap "nats-io/nats-tools"
tap "nikitabobko/tap"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Bash beautifier
brew "beautysh"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Debugger for the Go programming language
brew "delve"
# GNU multiple precision arithmetic library
brew "gmp"
# NaCl networking and cryptography library
brew "libsodium"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Bash-tool to store the private data inside a git repo
brew "git-secret"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Improved top (interactive process viewer)
brew "htop"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Simple terminal UI for git commands
brew "lazygit"
# Graphical front-end for GCC's coverage testing tool (gcov)
brew "lcov"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Modern shell for the GitHub era
brew "nushell"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Password manager
brew "pass"
# Pass extension for managing one-time-password tokens
brew "pass-otp"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Implementation of Java Servlet and JavaServer Pages
brew "tomcat"
# URL extractor/launcher
brew "urlview"
# Image processing library
brew "vips"
# Simple terminal image viewer written in Rust
brew "viu"
# Suite of barcodes-reading tools
brew "zbar"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Zsh port of Fish shell's history search
brew "zsh-history-substring-search"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# CLI for interacting with the OpenAI and Azure ChatGPT API
brew "kardolus/chatgpt-cli/chatgpt-cli"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# NATS utility
brew "nats-io/nats-tools/nats"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Electronics prototyping platform
cask "arduino-ide"
cask "font-blex-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-sketchybar-app-font"
# HTTP and GraphQL Client
cask "insomnia"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Replacement for Docker Desktop
cask "orbstack"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# App that enables mouse-free UI interaction
cask "shortcat"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "golang.go"
vscode "ms-vscode.sublime-keybindings"
vscode "sonarsource.sonarlint-vscode"
vscode "vscodevim.vim"
